const Rules = {
  // 用户名正则，4到16位（字母，数字，下划线，减号）
  USERNAME: /^[a-zA-Z0-9_-]{4,16}$/,
  // 密码强度正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
  PASSWORD: /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/,
  // 正整数正则
  ISPOSINT: /^\d+$/,
  // 负整数正则
  NEGINT:  /^-\d+$/,
  // 整数正则
  ISINT:  /^-?\d+$/,
  // 正数正则
  POSITIVENUM: /^\d*\.?\d+$/,
  // 负数正则
  MINUSNUM:/^-\d*\.?\d+$/,
  // 数正则
  ISPMNUM: /^-?\d*\.?\d+$/,
  // 邮箱
  ISEMAIL: /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/,
  // 电话号码
  ISPHONE: /^1[3|4|5|7|8|9][0-9]{9}$/,
  // 身份证号（18位）正则
  PID15: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/,
  // 身份证号（18位）正则
  PID18: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X|x)$/,
  // URL正则
  URL: /^((https?|ftp|file):\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/,
  // IPV4
  IPV4: /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/,
  // RGB Hex颜色正则#b8b8b8
  RGB: /^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$/,
  // 日期判定 2018-03-02
  DATE: /^\d{4}(\-)\d{1,2}\1\d{1,2}$/,
  // QQ号正则，5至11位
  QQ: /^[1-9][0-9]{4,10}$/,
  // 微信号正则，6至20位，以字母开头，字母，数字，减号，下划线
  WX: /^[a-zA-Z]([-_a-zA-Z0-9]{5,19})+$/,
  // 车牌号正则
  CARID: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/,
  // 验证输入的只能是中文
  CNTEXT: /^[\u4e00-\u9fa5]$/,
  // 邮编
  ZIPCODE: /[1-9]\d{5}(?!\d)/,
  // 纯数字
  ISNUM: /^[0-9]*$/,
  // 英文
  ISEN: /^[a-zA-Z]+$/,
  // 字符串
  ISTEXT:  /^\w+$/,
  // 小写字符串
  ISLOWER: /^[a-z]+$/,
  // 大写字符串
  ISUPPER: /^[A-Z]+$/
}

export default Rules
